In [1]:
import numpy as np
import pandas as pd

In [21]:
s = pd.Series([2,"a","b",5],index=["mon","tue","wed","thur"],name="for month sales")
s

mon     2
tue     a
wed     b
thur    5
Name: for month sales, dtype: object

In [256]:
s.values

array([2, 'a', 'b', 5], dtype=object)

In [257]:
s.index

Index(['mon', 'tue', 'wed', 'thur'], dtype='object')

In [258]:
sw = pd.Series([35,40,54,65,84,10,0],index=["mon","tue","wed","thu","fri","sat","sun"],name="Sandwiches sale per week")
sw

mon    35
tue    40
wed    54
thu    65
fri    84
sat    10
sun     0
Name: Sandwiches sale per week, dtype: int64

In [259]:
sw[0]

35

In [260]:
sw["mon"]

35

In [261]:
sw[2:5]

wed    54
thu    65
fri    84
Name: Sandwiches sale per week, dtype: int64

In [262]:
sw[[2,5]]

wed    54
sat    10
Name: Sandwiches sale per week, dtype: int64

In [263]:
sw[["mon","wed"]]

mon    35
wed    54
Name: Sandwiches sale per week, dtype: int64

In [264]:
sw[sw>35]

tue    40
wed    54
thu    65
fri    84
Name: Sandwiches sale per week, dtype: int64

In [265]:
sw*2

mon     70
tue     80
wed    108
thu    130
fri    168
sat     20
sun      0
Name: Sandwiches sale per week, dtype: int64

In [266]:
print(sw)
sw=sw*2
print(sw)

mon    35
tue    40
wed    54
thu    65
fri    84
sat    10
sun     0
Name: Sandwiches sale per week, dtype: int64
mon     70
tue     80
wed    108
thu    130
fri    168
sat     20
sun      0
Name: Sandwiches sale per week, dtype: int64

In [267]:
"mon" in sw

True

In [268]:
"mon" not in sw

False

In [269]:
arr = np.array([2,45,5,8])
ar = np.array(["a","b","c","d"])
obj2  = pd.Series(arr,index=ar)
obj2

a     2
b    45
c     5
d     8
dtype: int64

In [270]:
data = {"sindh":4000,"punjab":5000,"KPK":3000,"Balochistan":2000}
tax_by_state =pd.Series(data, index=["sindh","Balochistan","punjab","KPK","GB"])
tax_by_state

sindh          4000.0
Balochistan    2000.0
punjab         5000.0
KPK            3000.0
GB                NaN
dtype: float64

In [271]:
pd.isnull(tax_by_state)

sindh          False
Balochistan    False
punjab         False
KPK            False
GB              True
dtype: bool

In [272]:
tax_by_state.name="total tax of state"
tax_by_state.index.name="state name"
tax_by_state

state name
sindh          4000.0
Balochistan    2000.0
punjab         5000.0
KPK            3000.0
GB                NaN
Name: total tax of state, dtype: float64

In [273]:
sw.index=["m","t","w","th","f","s","su"]
sw

m      70
t      80
w     108
th    130
f     168
s      20
su      0
Name: Sandwiches sale per week, dtype: int64

In [274]:
oranges=pd.Series( [2,1,4,5],index=["a","b","c","d"])
apple=pd.Series([4,5,6,7],index=["a","b","c","d"])
data={"apple":apple,"oranges":oranges}
data1=pd.DataFrame(data)
data1

   apple  oranges
a      4        2
b      5        1
c      6        4
d      7        5

In [275]:
data2= {"state":["ohio","ohio","ohio","navada","navada"],
        "year":[2000,2002,2004,2010,2001],
        "pop":[1.5,2.0,3,2,5]}
frame=pd.DataFrame(data2,index=["m","t","W","Tu","f"])
frame.columns=["pop","year","state"]
frame

       pop  year  state
m     ohio  2000    1.5
t     ohio  2002    2.0
W     ohio  2004    3.0
Tu  navada  2010    2.0
f   navada  2001    5.0

In [276]:
frame2 =pd.DataFrame(data2,index=["one","two","three","fourth","fifth"],columns=["year","pop","state","debt"])
frame2

        year  pop   state debt
one     2000  1.5    ohio  NaN
two     2002  2.0    ohio  NaN
three   2004  3.0    ohio  NaN
fourth  2010  2.0  navada  NaN
fifth   2001  5.0  navada  NaN

In [277]:
print(frame2.columns)
print(frame2.index)

Index(['year', 'pop', 'state', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'fourth', 'fifth'], dtype='object')

In [278]:
frame2.loc["three"]

year     2004
pop       3.0
state    ohio
debt      NaN
Name: three, dtype: object

In [279]:
frame2["year"].iloc[2]

2004

In [280]:
frame2["debt"]=4
frame2

        year  pop   state  debt
one     2000  1.5    ohio     4
two     2002  2.0    ohio     4
three   2004  3.0    ohio     4
fourth  2010  2.0  navada     4
fifth   2001  5.0  navada     4

In [281]:
frame2["debt"]=np.arange(len(frame2))
frame2

        year  pop   state  debt
one     2000  1.5    ohio     0
two     2002  2.0    ohio     1
three   2004  3.0    ohio     2
fourth  2010  2.0  navada     3
fifth   2001  5.0  navada     4

In [282]:
val =pd.Series([2,3,4,5,6],index=["one",'two', 'three', 'fourth', 'fifth'])
frame2["debt"]=val
frame2

        year  pop   state  debt
one     2000  1.5    ohio     2
two     2002  2.0    ohio     3
three   2004  3.0    ohio     4
fourth  2010  2.0  navada     5
fifth   2001  5.0  navada     6

In [283]:
frame3=frame2.copy()
frame3["state"]=np.arange(len("state"))
frame3["pop"]=np.array([5,8,4,7,5])
frame3

        year  pop  state  debt
one     2000    5      0     2
two     2002    8      1     3
three   2004    4      2     4
fourth  2010    7      3     5
fifth   2001    5      4     6

In [284]:
f =lambda x:x*3
frame3["new"] = 
frame3.apply(f,axis=0)
frame3

SyntaxError: invalid syntax (<ipython-input-284-d4376f6f8b95>, line 2)

In [285]:
df6=pd.DataFrame(np.arange(40).reshape((8,5)),
                index=["two","one","as","asd","df","ascd","bv","r"],columns=["d","a","b","c","e"])
df6

       d   a   b   c   e
two    0   1   2   3   4
one    5   6   7   8   9
as    10  11  12  13  14
asd   15  16  17  18  19
df    20  21  22  23  24
ascd  25  26  27  28  29
bv    30  31  32  33  34
r     35  36  37  38  39

In [286]:
df6.sort_index(axis=1,ascending=False)

       e   d   c   b   a
two    4   0   3   2   1
one    9   5   8   7   6
as    14  10  13  12  11
asd   19  15  18  17  16
df    24  20  23  22  21
ascd  29  25  28  27  26
bv    34  30  33  32  31
r     39  35  38  37  36

In [287]:
df6.sort_index()

       d   a   b   c   e
as    10  11  12  13  14
ascd  25  26  27  28  29
asd   15  16  17  18  19
bv    30  31  32  33  34
df    20  21  22  23  24
one    5   6   7   8   9
r     35  36  37  38  39
two    0   1   2   3   4

In [288]:
df6.sort_values(by="b")

       d   a   b   c   e
two    0   1   2   3   4
one    5   6   7   8   9
as    10  11  12  13  14
asd   15  16  17  18  19
df    20  21  22  23  24
ascd  25  26  27  28  29
bv    30  31  32  33  34
r     35  36  37  38  39

In [289]:
df6.mean(axis="columns")

two      2.0
one      7.0
as      12.0
asd     17.0
df      22.0
ascd    27.0
bv      32.0
r       37.0
dtype: float64

In [290]:
df6["a"].unique()

array([ 1,  6, 11, 16, 21, 26, 31, 36])

In [291]:
df6["a"].value_counts()

16    1
1     1
36    1
21    1
6     1
26    1
11    1
31    1
Name: a, dtype: int64

In [292]:
df6.iloc[:,[3,4,0]]

       c   e   d
two    3   4   0
one    8   9   5
as    13  14  10
asd   18  19  15
df    23  24  20
ascd  28  29  25
bv    33  34  30
r     38  39  35

In [293]:
df7=df6.copy()
df7["a"]=np.nan

In [294]:
add=df6.add(df7,fill_value=0)

In [295]:
add

       d     a   b   c   e
two    0   1.0   4   6   8
one   10   6.0  14  16  18
as    20  11.0  24  26  28
asd   30  16.0  34  36  38
df    40  21.0  44  46  48
ascd  50  26.0  54  56  58
bv    60  31.0  64  66  68
r     70  36.0  74  76  78

In [296]:
a=pd.Series([2,2,2,2,2],index=list("dabce"))
g=add-a
g

       d     a   b   c   e
two   -2  -1.0   2   4   6
one    8   4.0  12  14  16
as    18   9.0  22  24  26
asd   28  14.0  32  34  36
df    38  19.0  42  44  46
ascd  48  24.0  52  54  56
bv    58  29.0  62  64  66
r     68  34.0  72  74  76